Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.PositionCoordY Property
 Global coordinate Y (mm) when inserting result. Local (part) coordinate Y (mm) when getting results.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double PositionCoordY { get; set; }
Public Property PositionCoordY As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace